#include <bits/stdc++.h>
using namespace std;

int main() {
    short t; cin>>t;
    while(t--)
    {
        short n; cin>>n;
        short a[n],b[n];
        short i;
        short x = 0 ; // x --> هي قيمة أعلى جودة إجابة --> x=1 -> قيمة ابتدائيّة --> since, ( 1 ≤ a[i] , b[i] ≤ 50 )
        // ولكن اخترت قيمة -> x -> أصغر من أصغر قيمة ممكنة (صفر أصغر من واحد )
        
        short y = 0; // لتخزين رقم المُتسابق صاحب أعلى جودة إجابة
        // انتباه : يجب تعيين قيمة ابتدائية للمتغيّر -> y
        // لإنه لو ما تحقق الشرط  " اللي في السّطر البرمجي 21 " --> :
        // قيمة المتغيّر -> y -> ما رح يتم تهيئتها وبالتالي رح ينطبع ربش داتا
        
        for (i=0;i<n;i++)
        {
            cin>>a[i]; 
            cin>>b[i];
            if(a[i]<=10 && b[i]>x) {  y=i;  x=max(x,b[i]); }
        }
        
        cout<<++y<<endl; // زدنا قيمة 1 على قيمة -> y --> لأنّ السؤال تعامل مع المصفوفة على أنها تبدأ من إنديكس 1
    }
}
