#include <bits/stdc++.h>
using namespace std;
 
int main() {
    int n;
    cin>>n;
    int a[n];
    for(int i=0;i<n;i++)  {cin>>a[i]; a[i]--;} 
    // طرحت 1 من قيمة كل عنصر في المصفوفة لإنه قيمة العنصر رح يصير إنديكس للمصفوفة الثانية
    // والسؤال معتبر الإنديكس من 1 ، ولكن برمجياً الإنديكس من 0
    
    int p[n];
    for(int i=0;i<n;i++) p[a[i]]=i+1;
    // جمعت 1  للـ -> i -> عشان أعادل عملية الطرح السابقة ، لإنه فعلياً بتهمني القيمة نفسها للعنصر بدون تعديل
    
    for(int i=0;i<n;i++) cout<<p[i]<<" ";
    return 0;
}