#include <bits/stdc++.h>
using namespace std;

int main() 
{
    int t; cin>>t;
    while(t--)
    {
        int a,b,c,n;
        cin>>a>>b>>c>>n;
        long long Sum=a+b+c+n;
        //  المشكلة إللي واجهتنا إنه هالشّرط غير كافٍ 
        // مثال a=1 , b=1 , c=3 , n=1 --> Sum=a+b+c+n=6 --> تقبل القسمة على 3
        // ولكن نيجي نوزّع -> n -> على -> a,b,c --> النتيجة : الأعداد غير متساوية
        // لهيك بدنا كمان شرط إضافي .. وهو
        // x = (a+b+c+n)/3 --> then if x greater than a,b,c --> "YES" >> else "NO"

        // ليش نعمل هيك ؟
        // a+A=b+B=c+C -- > هذا الشّرط .. التّساوي
        //يعني العدد النهائي عند كل أخت لازم يكون متساوي
        // إذا كان هذا العدد هو --> x --> فسيكون:
       // 3*x = a+b+c+n
       // لذلك لازم يكون (a+b+c+n) --> قابلًا للقسمة على 3.

        // لحتى نحصل على التّساوي ولكن أيضاً إحنا ما بدنا نوخذ من أخت ونعطي للأخت الثانية
        // لهيك لازم أتأكّد لمّا قسمت المجموع على 3 .. ناتج القسمة ( أكبر أو يساوي )  العملات إللي جمعتها كل أخت  ؟؟
        // إذا آه .. تمام معناها أنا بقدر أعطي من العملات إللي معي فقط لحتى يتساوى إللي مع الأخوات

        // فبهالشّرطين بكون حققت المطلوب
        // و راعيت إنّه : distribute all n coins ... a+A=b+B=c+C

        long long x = (Sum)/3;
        if( Sum%3==0 && ( x>=max({a,b,c}) ) ) cout<<"YES\n";
        else cout<<"NO\n";
    }
    return 0;
}
