// الفكرة إبداع للأمانة ، بتعتمد على --> XOR
// للتذكير :
// x XOR x = 0 
// x XOR 0 = x
// فهالقاعدتين مهمات جداً وكثير رح يفيدوني في إيجاد الاختلاف ، بحيث اذا في تشابه الناتج صفر واذا في اختلاف الناتج هو الحرف المختلف وهو المطلوب من السؤال
class Solution {
public:
    char findTheDifference(string s, string t) {
        int n = t.size();
        char x = 0;
        for(int i=0;i<n-1;i++)
        {
            x^=s[i]^t[i];
        }
        x^=t[n-1]; // لحتى ما يصير وصول لمكان غير موجود ، لإنه طول السلستين مختلف بمقدار حرف واحد
        return x;
    }
};
