//  هذا السؤال بشكل عكسي ، معطيني -> sum -> وبده -> n
// sum = n*(n+1) / 2 ;
// سؤالنا بده العكس :
// بسؤالنا : --> sum = N , n = k

// بناءً على القانون :
// 2N >= K*(K+1) --> هاي حطيتها شرط بالفور لوب
// طبعاً حكيت أكبر أو يساوي لإنه السؤال هيك طلب
// وخطوة مهمة إني أطرح  -> K -> بمقدار واحد 
// (منطقياً هيك الصح ، بس مش عارف أكتب عليها ملاحظة =)

#include <bits/stdc++.h>
using namespace std;
int main()
{   
    long long N,i,k=0;
    cin>>N;
    for(i=1;2*N>=k*(k+1);i++)
    {
        k++;
    }
    k--; // مهم جداً ، مش عارف شو أكتب عليه ملاحظة ، بس هالحركة مهمة
    cout<<k;
    return 0;
}
