// السؤال رهييب والقنبلة إللي فيه جميلة =)
#include <bits/stdc++.h>
using namespace std;
int main()
{   
    int t; cin>>t;
    while(t--)
    {
        string n; // لإنه حدود -> n ->  كبيرة جداً
        // 1 ≤ N ≤ 10^1000
        cin>>n;
        if( ( n[n.size()-1]-'0' ) %2 == 0) cout<<"YES\n";
        // لإنه قيمة -> n -> ممكن تكون كبيرة جداً ، وأنا بقدر أحكم فقط من الآحاد
        // إذا الآحاد بتقبل القسمة على 2 إذاً العدد زوجي
        // واستخدمت -->   n[n.size()-1]-'0'  -> لحتى أحوّل الرقم من سترينج إلى إنتجر
        else cout<<"NO\n";
    }
    return 0;
}
