#include <bits/stdc++.h>
using namespace std;

// لتقسيم عناصر المصفوفة إلى مجموعتين بحيث يكون مجموع العناصر في كل مجموعة زوجي أو فردي 
// إنّه لو المجموع عناصر المجموعة الأولى فردي فمجموع عناصر المجموعة الثاني فردي .. ولو زوجي -- زوجي 
// --> لتحقيق ذلك يجب أن يكون مجموع جميع عاصر المصفوفة يقبل القسمة على 2 يعني زوجي

int main() {
   short t; cin>>t;
   while(t--)
   {
       short n; cin>>n;
       short a[n];
       int sum=0;
       for( short i=0;i<n;i++)
       {
           cin>>a[i];
           sum+=a[i];
       }
       
       if(sum%2 == 0) cout<<"YES\n";
       else cout<<"NO\n";
   }
}
