//أولاً : إعادة صياغة السؤال : تم إعطائي عدّة كفاءات لعدّة فِـرَق ما عدا كفاءة فريق واحد
// المطلوب : إيجاد كفاءة الفريق (التي لم يتم تزويدي بها)

// ثانياً : تحليل السؤال
// كفاءة الفريق = (مجموع الأهداف اللي سجّلها) − (مجموع الأهداف اللي دخلت فيه)
// بمعنى آخر : نفس الهدف رح يكون +1 لنقاط الفريق الذي أحرز الهدف ، و -1 لنقاط الفريق الآخر
// لذلك فإنّ : مجموع كفاءات كل الفرق تساوي صفر

// طريقة الحل : اجمع المُعطيات ، والناتج (كفاءة الفريق المفقودة) هي عكس إشارة المجموع

#include <bits/stdc++.h>
using namespace std;
int main()
{   int t; cin>>t ;
    while(t--)
    {
        int n; cin>>n;
        int a[n];
        int sum=0;
        for(int i=0;i<n-1;i++) // n-1 : لإنه في فريق كفاءته مفقودة
        {
            cin>>a[i];
            sum+=a[i];
        }
        cout<<-sum<<endl; // حيث أنّ -> sum + (-sum) = 0 --> وهكذا يصبح  : مجموع كفاءات كل الفرق تساوي صفر
    }
    return 0;
}
